{
  "forceVisible": false,
  "content": [
    {
      "title": {
        "en": "Introduction"
      },
      "body": {
        "en": "<p>For the past few years, IMC has delivered numerous features and our customers recognize MSP (Manufacturing Sales Platform) as a feature-rich and powerful platform with highly customization capability. In 1908 release, instead of shipping more features, IMC puts more focus on improving the usability of the system to maximize existing features&rsquo; value for our customers.</p>\n<p>IMC introduces numbers of UI redesign of existing features, e.g. Quote Overview, Configurator, Opportunity Pipeline, and Product Catalogue. IMC has also introduced a highly robust UI framework, which enables customers to have customized UI on demand if the current standard UI components do not fulfill their business needs.</p>\n<p>To serve our manufacturing customers better, which often require tight integration with their existing ERP systems, IMC has also further enhanced its integration capability, e.g. account partner function synchronization, supporting scheduled jobs custom tables/views and some enhancements on pricing integration. Another significant millstone for integration is that in 1908 release MSP now opens its APIs, which enable third-party partners to leverage on MSP&rsquo;s robust configurator and pricing engines.</p>"
      },
      "position": 1
    },
    {
      "title": {
        "en": "Product Features"
      },
      "body": {
        "en": "<p><strong>UI Widget</strong></p>\n<p>Manufacturing sales process often involves multiple people or teams in both quote preparation and approval processes. There are often delays due to miscommunication or overlook. The usual system emails, reminders or notifications help in per task level. However, per-user level, it is still necessary to have a task-driven and personalized dashboard available to ensure all the assigned tasks for that specific user are closely followed up and eventually speed up the whole processes.</p>\n<p>&nbsp;</p>\n<p>The task-driven dashboard needs to be highly tailored based on each user&rsquo;s role and the tasks assigned in the sales process. The dashboard should be easily accessible since that is the starting point to guide users on what to perform in MSP.</p>\n<p>&nbsp;</p>\n<p>With the above considerations, MSP introduces a highly customized and robust UI framework, i.e. UI Widget. In MSP, the widget is a pre-built UI control that performs a specific task. e.g.</p>\n<ul>\n<li>A table control that shows \"Open Quote&rdquo;</li>\n<li>A table control that shows &ldquo;Opportunity in Quotation phase&rdquo;</li>\n<li>A graph control that shows quote header information, e.g. pricing date, currency and total quote amount</li>\n</ul>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/1-UI Widget framework concept.png\" alt=\"\" width=\"50%\" /></p>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/2-Home Page with UI Widgets.png\" alt=\"\" width=\"100%\" /></p>\n<p>UI developers can insert placeholders of UI Widget to the area where it makes business sense. Currently, the UI Widget applies only on Home Page. It can be further extended to other pages in the future. More UI widget controls will be continually added to the framework based on demand.</p>\n<p>&nbsp;</p>\n<p><strong>Similar Quote Check</strong></p>\n<p>It happens often that distributors or end customers may request multiple quotes for the same tender/project.&nbsp; It is business-critical for the sales representative to provide quotes with consistent pricing for the same tender/project. Even if sales representative decides to provide inconsistent pricing due to certain reasons, they will need to do so in a well-informed manner. Hence, it is critically important for sales representatives to have a holistic picture about the tender/project so that they can make informed strategic decisions.</p>\n<p>MSP introduces Similar Quote Check feature which provides a very customized way of search for similar quotes. Users can search based on quote header parameters, quote partner function, line items (i.e. products) and dynamic attribute values. The results are ranked in terms of direct hits based on each search criteria.</p>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/3-Define Similar Quote Check criteria.png\" alt=\"\" width=\"100%\" /></p>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/4-Similar Quote Check Result page.png\" alt=\"\" width=\"100%\" /></p>"
      },
      "position": 2
    },
    {
      "title": {
        "en": "Product Features"
      },
      "body": {
        "en": "<p><strong>Enable administrator to set system/user preferences</strong></p>\n<p>To enable truly customized and tailored sales journey, MSP already supports to allow the user to set his/her own user preference on how MSP system behaves, e.g. notification, default report templates, system parameters, and configurator settings.</p>\n<p>In 1908 release, MSP further extends this capability to enable the administrator to set system preference and even allow them to mass set the preference on behalf of users. This can be extremely helpful for project initial setup and non-tech-savvy users. Below are the system/user preferences that MSP enables the administrator to set:</p>\n<p><strong>Notifications</strong></p>\n<ul>\n<li>Receive Email</li>\n<li>Receive Approval Email</li>\n<li>Receive Routing Email</li>\n<li>Receive Notification Email</li>\n</ul>\n<p><strong>Report Templates</strong></p>\n<ul>\n<li>Save Proposal as Attachment</li>\n</ul>\n<p><strong>System</strong></p>\n<ul>\n<li>Default Language</li>\n<li>Default Currency</li>\n<li>Time zone</li>\n<li>Enable interactive pricing</li>\n</ul>\n<p><strong>Configurator</strong></p>\n<ul>\n<li>Label Font Size</li>\n<li>Hide Sub-label</li>\n<li>Hide comment button</li>\n<li>Configurator Attribute Single Row mode</li>\n<li>Label Width</li>\n<li>Configurator Pagination Mode</li>\n<li>Use Fluid Layout</li>\n<li>Value Option Threshold</li>\n<li>Show Attribute Positions</li>\n</ul>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/5-Preference update for system by administrator.png\" alt=\"\" width=\"100%\" /></p>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/6-Preference update for users by administrator.png\" alt=\"\" width=\"100%\" /></p>"
      },
      "position": 3
    },
    {
      "title": {
        "en": "Product Features"
      },
      "body": {
        "en": "<p><strong>Quote Overview View New Design</strong></p>\n<p>To further improve the user experience and provide users with a more consolidated place for quote head information, the former Quote Overview and Additional Attribute views are merged into a combined Quote Overview tab. IMC also introduced a separate Pricing Information section to control multiple pricing scheme/procedure determination.</p>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/7-Quote Overview page.png\" alt=\"\" width=\"100%\" /></p>\n<p><strong>Configurator paginated view enhancement</strong></p>\n<p>MSP&rsquo;s configurator page is where sales representative and sales engineers spend most of the time in the system. We have been constantly reaching out to our customers, get feedbacks and continue to improve configurator&rsquo;s usability. In 1908 release, below fine-tunings are done:</p>\n<ul>\n<li>Ability to list all sub-groups of a group within one page</li>\n<li>Make the paginated view the default and the only view which to avoid any setting confusion</li>\n</ul>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/8-Configurator Page.png\" alt=\"\" width=\"100%\" /></p>\n<p>&nbsp;</p>\n<p><strong>Opportunity Pipeline new design</strong></p>\n<p>IMC has been getting positive feedbacks on the opportunity pipeline feature. In 1908 release, a leaner design has been introduced.</p>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/9-Opportunity Pipeline view.png\" alt=\"\" width=\"100%\" /></p>\n<p>It also comes with easy-to-use filters on the top left. The selected criteria are now showing upfront on the top and users will be able to remove them directly without going into the filter selector.</p>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/10-Opportunity Pipeline filter.png\" alt=\"\" width=\"100%\" /></p>\n<p>&nbsp;</p>\n<p><strong>Email Approval</strong></p>\n<p>Approval process often takes time due to various reasons. One of the main reasons is that people in the approval process are often on sites with their customers or on a business trip, where they are not convenient to access MSP to approve/reject the quote in a timely manner. To speed up the approval process, MSP introduces Email Approval feature where people in the approval process can simply access the email from their mobile devices and take necessary actions (i.e. approve or reject) without logging into MSP.</p>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/11-Email Approval.png\" alt=\"\" width=\"100%\" /></p>\n<p>&nbsp;</p>"
      },
      "position": 4
    },
    {
      "title": {
        "en": "Product Features"
      },
      "body": {
        "en": "<p><strong>Product Catalogue new design</strong></p>\n<p>A leaner design of product catalogue is introduced. To have a consistent user experience, users from multiple entries point to the product catalog will now view the same design.</p>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/12-Product Catalogue.png\" alt=\"\" width=\"100%\" /></p>\n<p>&nbsp;</p>\n<p><strong>Multiple Pricing Scheme/Procedure determination</strong></p>\n<p>Manufacturing customers have been facing pricing competition across the word. To stay competitive in the market, they often introduce various highly customized and dynamic pricing strategy.</p>\n<p>To better support our customers, IMC further enhances MSP&rsquo;s both internal and external pricing engines. Now MSP can support multiple pricing schemes/procedure determination based on quote header parameters (i.e. sales organization, distribution channel, division, and document type) and the customer account selected. This has significantly enabled IMC&rsquo;s customers to have much more flexibility to implement various pricing strategy.</p>\n<p>&nbsp;</p>\n<p><strong>Price Items enhancements</strong></p>\n<p>Price items concepts enable the customer to have complex and multiple pricing condition calculations for a single line item. To further improve the usability, MSP has included the following changes in 1908 release:</p>\n<ul>\n<li>Ability to show and change the condition type&rsquo;s base unit and unit of measure</li>\n<li>Showing the condition type ERP ID on the Price Items screen</li>\n<li>Showing a pricing condition&rsquo;s status, i.e. active and inactive</li>\n<li>Ability to trigger ERP pricing from Price Items screen</li>\n</ul>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/13-Price Items screen.png\" alt=\"\" width=\"100%\" /></p>\n<p>&nbsp;</p>\n<p><strong>MSP APIs with OAuth based authentication</strong></p>\n<p>MSP has powerful built-in both product configuration and pricing engines. To extend the capability to third party applications, MSP proudly announces that all APIs which are previously consumed by MSP internally is now open to third party applications to consume. The APIs are with OAuth based authentication. Consumers can register their systems with an MSP instance and get a client ID using which the authentication will be authorized.</p>\n<p>With the open APIs, MSP further completes its platform strategy and enable third party applications especially customers&rsquo; existing systems to leverage the powerful APIs available.</p>\n<p>&nbsp;</p>\n<p><strong>Account and Partner Function enhancement</strong></p>\n<p>Continuing from the Account Data Sync from ERP in 1904 release, MSP is further enhanced to synchronize account&rsquo;s partner function maintained in ERP.</p>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/14-Partner function or role screen.png\" alt=\"\" width=\"100%\" /></p>\n<p>On top of the partner function synchronization, the following enhancements are also introduced:</p>\n<ul>\n<li>Introduce more data points (i.e. main address country and city) at below places\n<ul>\n<li>Accounts page</li>\n<li>Account selection screen under Create Quote view</li>\n</ul>\n</li>\n<li>Enable pagination for Partner selector in Create Partner view under account</li>\n<li>Relax the rules to allow quote to be created with different accounts under the same opportunity</li>\n<li>Allow quotes to be assigned to an existing opportunity</li>\n<li>Enable opportunity selector in Create Quote screen</li>\n<li>Enable pagination for Opportunity selector under both Quote Overview page and Create Quote screen</li>\n</ul>"
      },
      "position": 5
    },
    {
      "title": {
        "en": "Product Features"
      },
      "body": {
        "en": "<p><strong>System Tasks enhancement</strong></p>\n<p>MSP already supported scheduled synchronization jobs for products and accounts from ERP. Now it further extends this capability to custom lookup tables, too. This has significantly further improved MSP&rsquo;s integration and customization capability. Customers now can flow in customized data set automatically based on scheduled job and ensure MSP always provides the latest data sets and business logic to manufacturing users.</p>\n<p>From the administration UI, MSP consolidates with previous product, account and report synchronization screens into a central place to administrate easily. MSP also introduces a monitoring dashboard, i.e. System Tasks to show which tasks are running and which process unit it completes the run.</p>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/15- Master data screen under System Tasks.png\" alt=\"\" width=\"100%\" /></p>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/16-Task screen under System Tasks.png\" alt=\"\" width=\"100%\" /></p>\n<p>Below is a summary of the types of task resource supported:</p>\n<ul>\n<li>Account Sync Job: To sync accounts from ERP</li>\n<li>Delete Sync History job: To delete the Sync History (Introduce in 1908 release)</li>\n<li>Product Sync Job: To sync products from ERP</li>\n<li>ERP Table Sync Job: To sync table from ERP (Introduce in 1908 release)</li>\n<li>Report Sync Job: To sync MX report data to external system</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>Product/KB sync enhancement</strong></p>\n<p>It is critical for the sales representative to churn out the quote quickly and accurately. To win the deal, it often happens that the master data is changed in very last minutes. To ensure the latest data flow into MSP soonest, MSP also provides the options for business administration to synchronize the data manually and have the immediate impact of the master data change. Now MSP has introduced another two data points to be able to manually synchronize from ERP, i.e. knowledge base and product variant.</p>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/17-ERP Sync for knowledge base and product variant.png\" alt=\"\" width=\"100%\" /></p>\n<h2>&nbsp;</h2>\n<h2>Performance improvements</h2>\n<p>Below is performance improvement that have been done in 1908 release:</p>\n<ul>\n<li><strong>Save and reload cache from the database</strong></li>\n</ul>\n<p>MSP can now save the last cached data in configuration and pricing engine. The data is saved into MSP database and upon system start, it is then restored back into MSP&rsquo;s engine cache. This significantly reduces the time taken to reload the data from ERP.</p>\n<ul>\n<li><strong>Save time in a load of attributes metadata from configuration engine</strong></li>\n</ul>\n<p>Previously most of the meta-information from configuration engine was reloaded on every transaction. This has been improved and now only loaded once.</p>\n<ul>\n<li><strong>line-item Grid View</strong></li>\n</ul>\n<p>To give an improved performance on the quote line item view, Grid View is introduced. This view can be enabled using a setting. It is also supported with all features of the responsive view. This new line-items Grid View can support rendering for 1000+ line items quickly.</p>\n<p><img src=\"https://raw.githubusercontent.com/in-mind-cloud/content/master/global/assets/images/1908/18-Line-item Grid view.png\" alt=\"\" width=\"100%\" /></p>"
      },
      "position": 6
    },
    {
      "title": {
        "en": "Tool Support"
      },
      "body": {
        "en": "<ul>\n<li><strong>Groovy extension point update</strong></li>\n</ul>\n<p>All quote related groovy extension points now get full sales item tree in input parameter and can execute any postscript actions on the quote. In addition, more data points are made available in the groovy interface.</p>\n<ul>\n<li><strong>Groovy extension on change of quote currency and/or pricing date change</strong></li>\n</ul>\n<p>This is a new extension point introduced.</p>\n<ul>\n<li><strong>Groovy extension on Made to Order operations of creating material, bill of material and routing</strong></li>\n</ul>\n<p>The Made to Order operations of create material, bill of material and material routing are now groovy enabled. This is done to support customer specific needs more clearly.</p>\n<ul>\n<li><strong>BOM Explosion with Same Range Value in Different DA in Different Rows</strong></li>\n</ul>\n<p>Enhancements are introduced to support BOM Explosion with Same Range Value in Different DA in Different Rows/trigger groups.</p>\n<ul>\n<li><strong>HTML Audits for configuration engine</strong></li>\n</ul>\n<p>More HTML audits are made available for both configuration and pricing engine. In addition, the output structure and folder naming has been standardized.</p>\n<ul>\n<li><strong>Simplification of KB condition trigger actions</strong></li>\n</ul>\n<p>Creating KB Conditional Triggers is now made very easy. User does not even need to type and can perform the action by simple clicks only.</p>\n<ul>\n<li><strong>SPARQL drop/alternate for quote</strong></li>\n</ul>\n<p>Starting from 1908 release, there is little to no need of using SPARQL on quote. Users can use IMCScript to compute documentHeaderPrice and itemHeaderTotalPrice.</p>\n<ul>\n<li><strong>Pricing scheme &ndash; excel based definition</strong></li>\n</ul>\n<p>Starting from 1908 release, users can download a pricing scheme in excel format, make changes and upload back into the system.</p>"
      },
      "position": 7
    },
    {
      "title": {
        "en": "Other Enhancement"
      },
      "body": {
        "en": "<p><strong>Other enhancements</strong></p>\n<p>Some other enhancements in the sales process were also delivered. These include:</p>\n<ol>\n<li>Reduce data in cached data set, i.e. TimeZone, IMCScript.</li>\n<li>The filter of inactive users in case of tagging.</li>\n<li>A Sales Item for which an ERP material is created cannot be deleted in the quote it belongs to.</li>\n<li>Quote has TimeZone is now defaulted based on user time zone or sales_system_instance timezone in that order. Users have the option to change the time zone, too.</li>\n<li>Default Quote language based on Account language, next user language.</li>\n<li>Enhancement to support Google Maps API upgrade</li>\n<li>Enable copy of an active IMCScript from browser.</li>\n<li>Allow users to be searched in their first and last names as well if searched in user object name only.</li>\n<li>Read the symbolic value image path from IMCScript.</li>\n<li>Making a line item optional is supported in any quote status.</li>\n<li>Quotes do not need to be saved until change happens</li>\n<li>CFC quote import/export enhancements related to import of product with ERP External ID and with product list price if any in CFC</li>\n<li>User has the option to save a quote without seeing the pricing pop-up screen. This can be achieved using a setting: SettingDisablePopupOfPricing.</li>\n<li>Quote type is no longer mandatory on quote creation</li>\n<li>Support ERP BOM explosion and line item ordering</li>\n</ol>\n<p>&nbsp;</p>\n<p><strong>Bugfixes and Cleanup &shy;&shy;&shy;</strong></p>\n<ol>\n<li>IMCSemantic model test cases.</li>\n<li>IMSScript test cases.</li>\n<li>All SAP premium certification-based comments are incorporated.</li>\n<li>Fix product class sync when there is more than one class in variant.</li>\n</ol>"
      },
      "position": 8
    }
  ]
}
